lvniqi/stm32L1/Project/STMTouch__Examples/STM32L152_Ex06_Linear_DISC/src/discovery_lcd.c
/**
  ******************************************************************************
  * @file    STM32L152_Ex06_Linear_DISC\src\discovery_lcd.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    24-February-2014
  * @brief   This file includes driver for the glass LCD Module mounted on
  *          STM32L discovery board MB963
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "discovery_lcd.h"
#include "stm32l1xx_lcd.h"

#define BUTTON_GPIO_PORT GPIOA
#define USER_GPIO_PIN  GPIO_Pin_0
    
/* this variable can be used for accelerate the scrolling exit when push user button */
uint8_t KeyPressed = 0;

/* LCD BAR status: We don't write directly in LCD RAM for save the bar setting */
uint8_t t_bar[2] = {0x0, 0X0};

/*  =========================================================================
                                 LCD MAPPING
    =========================================================================
     A
     _  ----------
COL |_| |\   |J  /|
       F| H  |  K |B
     _  |  \ | /  |
COL |_| --G-- --M--
        |   /| \  |
       E|  Q |  N |C
     _  | /  |P  \|
DP  |_| -----------
     D

 An LCD character coding is based on the following matrix:
      { E , D , P , N   }
      { M , C , COL , DP}
      { B , A , K , J   }
      { G , F , Q , H   }

 The character 'A' for example is:
  -------------------------------
LSB   { 1 , 0 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
MSB   { 1 , 1 , 0 , 0   }
      -------------------
  'A' =  F    E   0   0 hexa

*/

/* Constant table for cap characters 'A' --> 'Z' */
const uint16_t CapLetterMap[26] =
  {
    /* A      B      C      D      E      F      G      H      I  */
    0xFE00, 0x6714, 0x1d00, 0x4714, 0x9d00, 0x9c00, 0x3f00, 0xfa00, 0x0014,
    /* J      K      L      M      N      O      P      Q      R  */
    0x5300, 0x9841, 0x1900, 0x5a48, 0x5a09, 0x5f00, 0xFC00, 0x5F01, 0xFC01,
    /* S      T      U      V      W      X      Y      Z  */
    0xAF00, 0x0414, 0x5b00, 0x18c0, 0x5a81, 0x00c9, 0x0058, 0x05c0
  };

/* Constant table for number '0' --> '9' */
const uint16_t NumberMap[10] =
  {
    /* 0      1      2      3      4      5      6      7      8      9  */
    0x5F00, 0x4200, 0xF500, 0x6700, 0xEa00, 0xAF00, 0xBF00, 0x04600, 0xFF00, 0xEF00
  };

static void LCD_Conv_Char_Seg(uint8_t* c, uint8_t point, uint8_t column, uint8_t* digit);

void Delay(uint32_t tempo);
void LCD_contrast(void);

void Delay(uint32_t tempo)
{
  uint32_t i = 0;
  while (tempo--)
    for (i = 1000;i > 0;i--);
}

/**
  * @brief  Configures the LCD GLASS relative GPIO port IOs and LCD peripheral.
  * @param  None
  * @retval None
  */
void LCD_GLASS_Init(void)
{
  LCD_InitTypeDef LCD_InitStruct;


  LCD_InitStruct.LCD_Prescaler = LCD_Prescaler_1;//LCD_Prescaler_8;
  LCD_InitStruct.LCD_Divider = LCD_Divider_31;//LCD_Divider_16;
  LCD_InitStruct.LCD_Duty = LCD_Duty_1_4;
  LCD_InitStruct.LCD_Bias = LCD_Bias_1_3;
  LCD_InitStruct.LCD_VoltageSource = LCD_VoltageSource_Internal;


  /* Initialize the LCD */
  LCD_Init(&LCD_InitStruct);

  LCD_MuxSegmentCmd(ENABLE);

  /* To set contrast to mean value */
  LCD_ContrastConfig(LCD_Contrast_Level_3);

  LCD_DeadTimeConfig(LCD_DeadTime_0);
  LCD_PulseOnDurationConfig(LCD_PulseOnDuration_4);

  /*!< Wait Until the LCD FCR register is synchronized */
  LCD_WaitForSynchro();

  /*!< Enable LCD peripheral */
  LCD_Cmd(ENABLE);

  /*!< Wait Until the LCD is enabled */
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == RESET)
  {}
  /*!< Wait Until the LCD Booster is ready */
  while (LCD_GetFlagStatus(LCD_FLAG_RDY) == RESET)
  {}

  LCD_GLASS_Clear();
}

/**
  * @brief  LCD contrast setting min-->max-->min by pressing user button
  * @param  None
  * @retval None
  */
void LCD_contrast()
{
  uint32_t contrast ;

  /* To get the actual contrast value in register */
  contrast = LCD->FCR & LCD_Contrast_Level_7;

  while ((GPIOC->IDR & USER_GPIO_PIN) == 0x0)
  {
    contrast += LCD_Contrast_Level_1;

    if (contrast > LCD_Contrast_Level_7)
      contrast = LCD_Contrast_Level_0;

    LCD_ContrastConfig(contrast);
    Delay(100);
  }
}

/**
  * @brief  Setting bar on LCD, writes bar value in LCD frame buffer
  * @param  None
  * @retval None
  */
void LCD_bar()
{


  LCD->RAM[LCD_RAMRegister_4] &= 0xffff5fff;
  LCD->RAM[LCD_RAMRegister_6] &= 0xffff5fff;
  /* bar1 bar3 */
  LCD->RAM[LCD_RAMRegister_4] |= (uint32_t)(t_bar[0] << 12);

  /*bar0 bar2 */
  LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)(t_bar[1] << 12);

}

/**
  * @brief  Converts an ascii char to the a LCD digit.
  * @param  c: a char to display.
  * @param  point: a point to add in front of char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param  column : flag indicating if a column has to be add in front
  *         of displayed character.
  *         This parameter can be: COLUMN_OFF or COLUMN_ON.
  * @param  digit array with segment
  * @retval None
  */
static void LCD_Conv_Char_Seg(uint8_t* c, uint8_t point, uint8_t column, uint8_t* digit)
{
  uint16_t ch = 0 ;
  uint8_t i, j;

  switch (*c)
  {
    case ' ' :
      ch = 0x00;
      break;

    case '*':
      ch = star;
      break;

    case 'µ' :
      ch = C_UMAP;
      break;

    case 'm' :
      ch = C_mMap;
      break;

    case 'n' :
      ch = C_nMap;
      break;

    case '-' :
      ch = C_minus;
      break;

    case '0':
    case '1':
    case '2':
    case '3':
    case '4':
    case '5':
    case '6':
    case '7':
    case '8':
    case '9':
      ch = NumberMap[*c-0x30];
      break;

    case 204:
      ch = ASCII204;
      break;

    default:
      /* The character c is one letter in upper case*/
      if ((*c < 0x5b) && (*c > 0x40))
      {
        ch = CapLetterMap[*c-'A'];
      }
      /* The character c is one letter in lower case*/
      if ((*c < 0x7b) && (*c > 0x60))
      {
        ch = CapLetterMap[*c-'a'];
      }
      break;
  }

  /* Set the digital point can be displayed if the point is on */
  if (point)
  {
    ch |= 0x0002;
  }

  /* Set the "COL" segment in the character that can be displayed if the column is on */
  if (column)
  {
    ch |= 0x0020;
  }

  for (i = 12, j = 0 ;j < 4; i -= 4, j++)
  {
    digit[j] = (ch >> i) & 0x0f; //To isolate the less signifiant dibit
  }
}

/**
  * @brief  This function writes a char in the LCD frame buffer.
  * @param  ch: the character to display.
  * @param  point: a point to add in front of char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param  column: flag indicating if a column has to be add in front
  *         of displayed character.
  *         This parameter can be: COLUMN_OFF or COLUMN_ON.
  * @param  position: position in the LCD of the caracter to write [0:7]
  * @retval None
  * @par    Required preconditions: The LCD should be cleared before to start the
  *         write operation.
  */
void LCD_GLASS_WriteChar(uint8_t* ch, uint8_t point, uint8_t column, uint8_t position)
{
  uint8_t digit[4];     /* Digit frame buffer */

  /* To convert displayed character in segment in array digit */
  LCD_Conv_Char_Seg(ch, point, column, digit);

  /* TO wait LCD Ready */
  while (LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET) ;

  switch (position)
  {
      /* Position 1 on LCD (Digit1)*/
    case 1:
      LCD->RAM[LCD_RAMRegister_0] &= 0xcffffffc;
      LCD->RAM[LCD_RAMRegister_2] &= 0xcffffffc;
      LCD->RAM[LCD_RAMRegister_4] &= 0xcffffffc;
      LCD->RAM[LCD_RAMRegister_6] &= 0xcffffffc;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x0c) << 26) | (digit[0] & 0x03) ; ; // 1G 1B 1M 1E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x0c) << 26) | (digit[1] & 0x03); // 1F 1A 1C 1D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x0c) << 26) | (digit[2] & 0x03); // 1Q 1K 1Col 1P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x0c) << 26) | (digit[3] & 0x03); // 1H 1J 1DP 1N

      break;

      /* Position 2 on LCD (Digit2)*/
    case 2:
      LCD->RAM[LCD_RAMRegister_0] &= 0xf3ffff03;
      LCD->RAM[LCD_RAMRegister_2] &= 0xf3ffff03;
      LCD->RAM[LCD_RAMRegister_4] &= 0xf3ffff03;
      LCD->RAM[LCD_RAMRegister_6] &= 0xf3ffff03;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x0c) << 24) | ((digit[0] & 0x02) << 6) | ((digit[0] & 0x01) << 2) ; // 2G 2B 2M 2E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x0c) << 24) | ((digit[1] & 0x02) << 6) | ((digit[1] & 0x01) << 2) ; // 2F 2A 2C 2D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x0c) << 24) | ((digit[2] & 0x02) << 6) | ((digit[2] & 0x01) << 2) ; // 2Q 2K 2Col 2P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x0c) << 24) | ((digit[3] & 0x02) << 6) | ((digit[3] & 0x01) << 2) ; // 2H 2J 2DP 2N

      break;

      /* Position 3 on LCD (Digit3)*/
    case 3:
//      LCD->RAM[LCD_RAMRegister_0] &= 0xfcffffcf;
//      LCD->RAM[LCD_RAMRegister_2] &= 0xfcffffcf;
//      LCD->RAM[LCD_RAMRegister_4] &= 0xfcffffcf;
//      LCD->RAM[LCD_RAMRegister_6] &= 0xfcffffcf;
      LCD->RAM[LCD_RAMRegister_0] &= 0xfcfffcff;
      LCD->RAM[LCD_RAMRegister_2] &= 0xfcfffcff;
      LCD->RAM[LCD_RAMRegister_4] &= 0xfcfffcff;
      LCD->RAM[LCD_RAMRegister_6] &= 0xfcfffcff;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x0c) << 22) | ((digit[0] & 0x03) << 8) ; // 3G 3B 3M 3E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x0c) << 22) | ((digit[1] & 0x03) << 8) ; // 3F 3A 3C 3D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x0c) << 22) | ((digit[2] & 0x03) << 8) ; // 3Q 3K 3Col 3P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x0c) << 22) | ((digit[3] & 0x03) << 8) ; // 3H 3J 3DP 3N

      break;

      /* Position 4 on LCD (Digit4)*/
    case 4:
      LCD->RAM[LCD_RAMRegister_0] &= 0xffcff3ff;
      LCD->RAM[LCD_RAMRegister_2] &= 0xffcff3ff;
      LCD->RAM[LCD_RAMRegister_4] &= 0xffcff3ff;
      LCD->RAM[LCD_RAMRegister_6] &= 0xffcff3ff;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x0c) << 18) | ((digit[0] & 0x03) << 10) ; // 4G 4B 4M 4E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x0c) << 18) | ((digit[1] & 0x03) << 10) ; // 4F 4A 4C 4D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x0c) << 18) | ((digit[2] & 0x03) << 10) ; // 4Q 4K 4Col 4P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x0c) << 18) | ((digit[3] & 0x03) << 10) ; // 4H 4J 4DP 4N

      break;

      /* Position 5 on LCD (Digit5)*/
    case 5:
      LCD->RAM[LCD_RAMRegister_0] &= 0xfff3cfff;
      LCD->RAM[LCD_RAMRegister_2] &= 0xfff3cfff;
      LCD->RAM[LCD_RAMRegister_4] &= 0xfff3efff;
      LCD->RAM[LCD_RAMRegister_6] &= 0xfff3efff;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x0c) << 16) | ((digit[0] & 0x03) << 12) ; // 5G 5B 5M 5E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x0c) << 16) | ((digit[1] & 0x03) << 12) ; // 5F 5A 5C 5D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x0c) << 16) | ((digit[2] & 0x01) << 12) ; // 5Q 5K   5P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x0c) << 16) | ((digit[3] & 0x01) << 12) ; // 5H 5J   5N

      break;

      /* Position 6 on LCD (Digit6)*/
    case 6:
      LCD->RAM[LCD_RAMRegister_0] &= 0xfffc3fff;
      LCD->RAM[LCD_RAMRegister_2] &= 0xfffc3fff;
      LCD->RAM[LCD_RAMRegister_4] &= 0xfffc3fff;
      LCD->RAM[LCD_RAMRegister_6] &= 0xfffc3fff;

      LCD->RAM[LCD_RAMRegister_0] |= ((digit[0] & 0x04) << 15) | ((digit[0] & 0x08) << 13) | ((digit[0] & 0x03) << 14) ; // 6B 6G 6M 6E
      LCD->RAM[LCD_RAMRegister_2] |= ((digit[1] & 0x04) << 15) | ((digit[1] & 0x08) << 13) | ((digit[1] & 0x03) << 14) ; // 6A 6F 6C 6D
      LCD->RAM[LCD_RAMRegister_4] |= ((digit[2] & 0x04) << 15) | ((digit[2] & 0x08) << 13) | ((digit[2] & 0x01) << 14) ; // 6K 6Q    6P
      LCD->RAM[LCD_RAMRegister_6] |= ((digit[3] & 0x04) << 15) | ((digit[3] & 0x08) << 13) | ((digit[3] & 0x01) << 14) ; // 6J 6H   6N

      break;

    default:
      break;
  }

  /* Refresh LCD  bar */
  LCD_bar();

  /* Update the LCD display */
  LCD_UpdateDisplayRequest();

}

/**
  * @brief  This function writes a char in the LCD RAM.
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @retval None
  */
void LCD_GLASS_DisplayString(uint8_t* ptr)
{
  uint8_t i = 0x01;

  LCD_GLASS_Clear();
  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (i < 8))
  {
    /* Display one character on LCD */
    LCD_GLASS_WriteChar(ptr, 0, 0, i);

    /* Point on the next character */
    ptr++;

    /* Increment the character counter */
    i++;
  }
}

/**
  * @brief  This function writes a char in the LCD RAM.
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @retval None
  * @par    Required preconditions: Char is ASCCI value "Ored" with decimal point or Column flag
  */
void LCD_GLASS_DisplayStrDeci(uint16_t* ptr)
{
  uint8_t i = 0x01;
  uint8_t char_tmp;

  LCD_GLASS_Clear();
  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (i < 8))
  {
    char_tmp = (*ptr) & 0x00ff;

    switch ((*ptr) & 0xf000)
    {
      case DOT:
        /* Display one character on LCD with decimal point */
        LCD_GLASS_WriteChar(&char_tmp, POINT_ON, COLUMN_OFF, i);
        break;
      case DOUBLE_DOT:
        /* Display one character on LCD with decimal point */
        LCD_GLASS_WriteChar(&char_tmp, POINT_OFF, COLUMN_ON, i);
        break;
      default:
        LCD_GLASS_WriteChar(&char_tmp, POINT_OFF, COLUMN_OFF, i);
        break;
    }/* Point on the next character */
    ptr++;

    /* Increment the character counter */
    i++;
  }
}

/**
  * @brief  This function Clear the whole LCD RAM.
  * @param  None
  * @retval None
  */
void LCD_GLASS_Clear(void)
{
  uint8_t counter = 0;


  /* TO wait LCD Ready */
  while (LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET) ;

  for (counter = LCD_RAMRegister_0; counter <= LCD_RAMRegister_15; counter++)
  {
    LCD->RAM[counter] = 0;
  }

  /* Update the LCD display */
  LCD_UpdateDisplayRequest();

}

/**
  * @brief  Display a string in scrolling mode
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @param  nScroll: Specifies how many time the message will be scrolled
  * @param  ScrollSpeed : Speciifes the speed of the scroll, low value gives
  *         higher speed
  * @retval None
  * @par    Required preconditions: The LCD should be cleared before to start the
  *         write operation.
  */
void LCD_GLASS_ScrollSentence(uint8_t* ptr, uint16_t nScroll, uint16_t ScrollSpeed)
{
  uint8_t Repetition;
  uint8_t Char_Nb;
  uint8_t* ptr1;
  uint8_t str[7] = "";
  uint8_t Str_size;

  if (ptr == 0) return;

  /* To calculate end of string */
  for (ptr1 = ptr, Str_size = 0 ; *ptr1 != 0; Str_size++, ptr1++) ;

  ptr1 = ptr;

  LCD_GLASS_DisplayString(ptr);
  Delay(ScrollSpeed);

  /* To shift the string for scrolling display*/
  for (Repetition = 0; Repetition < nScroll; Repetition++)
  {
    for (Char_Nb = 0; Char_Nb < Str_size; Char_Nb++)
    {
      *(str) = * (ptr1 + ((Char_Nb + 1) % Str_size));
      *(str + 1) = * (ptr1 + ((Char_Nb + 2) % Str_size));
      *(str + 2) = * (ptr1 + ((Char_Nb + 3) % Str_size));
      *(str + 3) = * (ptr1 + ((Char_Nb + 4) % Str_size));
      *(str + 4) = * (ptr1 + ((Char_Nb + 5) % Str_size));
      *(str + 5) = * (ptr1 + ((Char_Nb + 6) % Str_size));
      LCD_GLASS_Clear();
      LCD_GLASS_DisplayString(str);

      /* user button pressed stop the scrolling sentence */
      if (KeyPressed)
        return;
      Delay(ScrollSpeed);
    }
  }

}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
